# EndTreatment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EndTreatmentType..::..EndTreatment Property
EndTreatmentType Class See Also
---
String describing the end treatment
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string EndTreatment { get; set; }
```

Visual Basic
---
```text
Public Property EndTreatment As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ EndTreatment {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace